package meetPractise_4;
//реализуйте метод getSumCheckArray.
//
//Правильная реализация должна получить массив значений int и вернуть массив логических значений, где каждый элемент является результатом проверки: является ли соответствующий исходный элемент суммой двух предыдущих элементов в данном массиве.
//
//Подробности:
//Гарантируется, что длина данного массива составляет 2 или более.
//Данный массив гарантированно не равен null.
//Метод возвращает массив логических значений, где каждый элемент является результатом для соответствующего элемента в данном массиве.
//Первые два элемента логического массива всегда false.
//Ввод:
//
//[1, -1, 0, 4, 6, 10, 15, 25]
//Вывод в консоли:
//
//[false, false, true, false, false, true, false, true]

public class MeetPractise_4_SumOfPrevious {
}
