package class_5;
//что хранит класс действия:

public class Action_Class_Deystviya {
    //поле для обработки (регулярное выражение, дефолтные значения, дркгие конструкции котор использ. в нескольких классах)

    //хранить результаты в качестве полей класса не следует. Их следует возвоащать в возвращаемых значениях (вместо void - ставим конкретное значение класса которое будет возвращаемым)


    //данные в качестве параметра метода

    public  void operation(){
        //
    }
    public void operationOthers(){

    }
}
